In [ ]:
# Preparar entorno
import sqlite3
import pandas as pd

In [ ]:
# Conectar a la base de datos
conn = sqlite3.connect('database.db')
cursor = conn.cursor()

In [15]:
# Con esta funci√≥n leemos los datos y lo pasamos a un DataFrame de Pandas
def sql_query(query):
    return pd.read_sql(query, conn)

In [31]:
#Creamos la tabla Reparto
cursor.execute ("""
CREATE TABLE IF NOT EXISTS Reparto (
    CodE INTEGER,
    CodB INTEGER,
    CodC INTEGER,
    Fecha DATE,
    Cantidad INTEGER,  
    PRIMARY KEY (CodE, CodB, CodC)
    FOREIGN KEY (CodE) REFERENCES Empleados(CodE)
    FOREIGN KEY (CodB) REFERENCES Bares(CodB)
    FOREIGN KEY (CodC) REFERENCES Cervezas(CodC)
)
""")

#Datos a insertar

valores=[
     (1, 1, 1, '2005-10-21', 20),
     (1, 1, 2, '2005-10-21', 48),
     (1, 2, 3, '2005-10-22', 60),
     (1, 4, 5, '2005-10-22', 4),
     (2, 2, 3, '2005-10-22', 48),
     (2, 2, 5, '2005-10-23', 42),
     (2, 4, 1, '2005-10-23', 480),
     (2, 4, 2, '2005-10-24', 72),
     (3, 3, 3, '2005-10-24', 48),
     (3, 3, 4, '2005-10-25', 20),
]
#Insertamos los datos
cursor.executemany("""
INSERT OR IGNORE INTO Reparto (CodE, CodB, CodC, Fecha, Cantidad)
VALUES (?, ?, ?, ?, ?)
""", valores)

#Confirmamos cambios
conn.commit()

In [16]:
query = '''
SELECT *
FROM Reparto
'''

df = sql_query(query)
df

   CodE  CodB  CodC       Fecha  Cantidad
0     1     1     1  2005-10-21        20
1     1     1     2  2005-10-21        48
2     1     2     3  2005-10-22        60
3     1     4     5  2005-10-22         4
4     2     2     3  2005-10-22        48
5     2     2     5  2005-10-23        42
6     2     4     1  2005-10-23       480
7     2     4     2  2005-10-24        72
8     3     3     3  2005-10-24        48
9     3     3     4  2005-10-25        20

In [23]:
#Creamos la tabla Empleados
cursor.execute ("""
CREATE TABLE IF NOT EXISTS Empleados (
    CodE INTEGER PRIMARY KEY,
    Nombre TEXT,
    Sueldo INTEGER
)
""")
#Datos a insertar

valores=[
     (1, "Carlos Lopez", 120000),
     (2, "Rosa Perez", 110000),
     (3, "Luisa Garcia", 100000),
  
]
#Insertamos los datos
cursor.executemany("""
INSERT OR IGNORE INTO Empleados (CodE, Nombre,Sueldo)
VALUES (?, ?, ?)
""", valores)

#Confirmamos cambios
conn.commit()

In [21]:
query = '''
SELECT *
FROM Empleados
'''

df = sql_query(query)
df

   CodE        Nombre  Sueldo
0     1  Carlos Lopez  120000
1     2    Rosa Perez  110000
2     3  Luisa Garcia  100000

In [26]:
#Creamos la tabla Bares
cursor.execute ("""
CREATE TABLE IF NOT EXISTS Bares (
    CodB INTEGER PRIMARY KEY,
    Nombre TEXT,
    Cif TEXT,
    Localidad TEXT
)
""")
#Datos a insertar

valores=[
     (1, "Stop", "11111111X", "Villa Botijo"),
     (2, "Las Vegas", "22222222Y", "Villa Botijo"),
     (3, "Club Social","", "Las Ranas"),
     (4, "Otra Ronda","33333333Z ", "La Esponja"),
  
]
#Insertamos los datos
cursor.executemany("""
INSERT OR IGNORE INTO Bares (CodB, Nombre,Cif,Localidad)
VALUES (?, ?, ?, ?)
""", valores)

#Confirmamos cambios
conn.commit()

In [27]:
query = '''
SELECT *
FROM Bares
'''

df = sql_query(query)
df

   CodB       Nombre         Cif     Localidad
0     1         Stop   11111111X  Villa Botijo
1     2    Las Vegas   22222222Y  Villa Botijo
2     3  Club Social                 Las Ranas
3     4   Otra Ronda  33333333Z     La Esponja

In [28]:
#Creamos la tabla Cervezas
cursor.execute ("""
CREATE TABLE IF NOT EXISTS Cervezas (
    CodC INTEGER PRIMARY KEY,
    Envase TEXT,
    Capacidad REAL,
    Stock INTEGER
)
""")

#Datos a insertar

valores=[
     (1, "botella", 0.2 , 3600),
     (2, "botella", 0.33 , 1200),
     (3, "lata", 0.33 , 2400),
     (4, "botella", 1 , 288),
     (5, "barril", 60 , 30),
    
]
#Insertamos los datos
cursor.executemany("""
INSERT OR IGNORE INTO Cervezas (CodC, Envase ,Capacidad , Stock)
VALUES (?, ?, ?, ?)
""", valores)

#Confirmamos cambios
conn.commit()

In [30]:
query = '''
SELECT *
FROM Cervezas
'''

df = sql_query(query)
df

   CodC   Envase  Capacidad  Stock
0     1  botella       0.20   3600
1     2  botella       0.33   1200
2     3     lata       0.33   2400
3     4  botella       1.00    288
4     5   barril      60.00     30

In [ ]:
#Obtener  el  nombre    de  los  empleados   que  hayan  repartido  al  bar  Stop  durante la semana 
#del 17 al 23 de octubre de 2005

IndentationError: unexpected indent (4153797254.py, line 12)